# OLDGetLoadDataReal

## Description
Using selector, gets load data with real value for the parametric object

```pascal
FUNCTION OLDGetLoadDataReal(
				handle    : HANDLE;
				selector  : INTEGER;
				loadIndex : INTEGER) : REAL;
```

```python

def vs.OLDGetLoadDataReal(handle, selector, loadIndex):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE||
|selector|INTEGER||
|loadIndex|INTEGER||

## Version
Availability: from Vectorworks 2018
## Category
* Truss Analysis